In [31]:
from pandas import Series
s1=Series([1,2,3])
s2=Series([50,40,35],index=(['l','b','h']))
s1+s2

0   NaN
1   NaN
2   NaN
b   NaN
h   NaN
l   NaN
dtype: float64

In [20]:
from pandas import DataFrame
data1={'l':[50,40,35],
      'b':[12,45,67]}
data1

{'l': [100, 200, 300], 'b': [12, 45, 67]}

In [21]:
frame1=DataFrame(data1)
frame1

     l   b
0  100  12
1  200  45
2  300  67

In [32]:
data2={'l':[50,40,35],
      'b':[12,45,67],
      'h':[34,89,90]}
data2

{'l': [50, 40, 35], 'b': [12, 45, 67], 'h': [34, 89, 90]}

In [23]:
frame2=DataFrame(data2)
frame2

     l   b   h
0  100  12  34
1  200  45  89
2  300  67  90

In [24]:
frame1+frame2

     b   h    l
0   24 NaN  200
1   90 NaN  400
2  134 NaN  600

In [25]:
frame2-s2

     l    b    h
0    0 -188 -266
1  100 -155 -211
2  200 -133 -210

In [26]:
frame2

     l   b   h
0  100  12  34
1  200  45  89
2  300  67  90

In [27]:
s2

l    100
b    200
h    300
dtype: int64

In [33]:
frame2+s2

     l    b    h
0  150   52   69
1  250   85  124
2  350  107  125

In [34]:
frame2-s1

    0   1   2   b   h   l
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN

In [35]:
frame2-s2

     l   b   h
0   50 -28  -1
1  150   5  54
2  250  27  55